#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main()
{
	char a = 3;
	//00000000000000000000000000000011
	//00000011 - a (char型1个字节/8个比特位,需要将32位截断成8位)
	char b = 127;
	//00000000000000000000000001111111
	//01111111 - b 
	char c = a + b;
	//00000000000000000000000000000011   整型提升后的a
	//00000000000000000000000001111111   整型提升后的b
	//00000000000000000000000010000010   计算后的c
	//10000010   又因为char型是1字节，因此需要截断
	int d = a + b;
	//00000000000000000000000000000011   整型提升后的a
	//00000000000000000000000001111111   整型提升后的b
	//00000000000000000000000010000010   计算后的d，即130

	printf("%d\n", c);   //注意！！！又因为打印的是%d整型，因此char c又需要进行整型提升  注：整型提升补位补的是符号位
	                     //11111111111111111111111110000010 - c整型提升后，储存的是补码
	                     //11111111111111111111111110000001 - c的反码
	                     //10000000000000000000000001111110 - c的原码     即打印的结果-126
	printf("%d\n", d);   //d本身就是整型，结果就是130
	//注：char c不仅在运算时发生整型提升，打印时也整型提升了，但是int d只在运算a+b时整型提升了
   return 0;
}